GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F24Q71.inc
;----- PIR0 Bits -----------------------------------------------------
SWIF             EQU  H'0000'
HLVDIF           EQU  H'0001'
OSFIF            EQU  H'0002'
CSWIF            EQU  H'0003'
NVMIF            EQU  H'0004'
CLC1IF           EQU  H'0005'
CRCIF            EQU  H'0006'
IOCIF            EQU  H'0007'


;----- PIR1 Bits -----------------------------------------------------
INT0IF           EQU  H'0000'
ADCH1IF          EQU  H'0001'
ADIF             EQU  H'0002'
ACTIF            EQU  H'0003'
C1IF             EQU  H'0004'
ADCH2IF          EQU  H'0005'
ADCH3IF          EQU  H'0006'
ADCH4IF          EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
ZCDIF            EQU  H'0000'
CLC5IF           EQU  H'0001'
IOCVIF           EQU  H'0002'
DMA1SCNTIF       EQU  H'0004'
DMA1DCNTIF       EQU  H'0005'
DMA1ORIF         EQU  H'0006'
DMA1AIF          EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
SPI1RXIF         EQU  H'0000'
SPI1TXIF         EQU  H'0001'
SPI1IF           EQU  H'0002'
TMR2IF           EQU  H'0003'
TMR1IF           EQU  H'0004'
TMR1GIF          EQU  H'0005'
CCP1IF           EQU  H'0006'
TMR0IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
U1RXIF           EQU  H'0000'
U1TXIF           EQU  H'0001'
U1EIF            EQU  H'0002'
U1IF             EQU  H'0003'
TMR3IF           EQU  H'0004'
TMR3GIF          EQU  H'0005'
PWM1PIF          EQU  H'0006'
PWM1IF           EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
CLC6IF           EQU  H'0001'
TU16AIF          EQU  H'0002'
C2IF             EQU  H'0004'
CLC2IF           EQU  H'0005'
PWM2PIF          EQU  H'0006'
PWM2IF           EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
INT1IF           EQU  H'0000'
CLC7IF           EQU  H'0001'
CWG1IF           EQU  H'0002'
NCO1IF           EQU  H'0003'
DMA2SCNTIF       EQU  H'0004'
DMA2DCNTIF       EQU  H'0005'
DMA2ORIF         EQU  H'0006'
DMA2AIF          EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
I2C1RXIF         EQU  H'0000'
I2C1TXIF         EQU  H'0001'
I2C1IF           EQU  H'0002'
I2C1EIF          EQU  H'0003'
CLC3IF           EQU  H'0005'
PWM3PIF          EQU  H'0006'
PWM3IF           EQU  H'0007'


;----- PIR8 Bits -----------------------------------------------------
U2RXIF           EQU  H'0000'
U2TXIF           EQU  H'0001'
U2EIF            EQU  H'0002'
U2IF             EQU  H'0003'
CLC4IF           EQU  H'0005'
CCP2IF           EQU  H'0006'
SCANIF           EQU  H'0007'


;----- PIR9 Bits -----------------------------------------------------
DMA3SCNTIF       EQU  H'0004'
DMA3DCNTIF       EQU  H'0005'
DMA3ORIF         EQU  H'0006'
DMA3AIF          EQU  H'0007'


;----- PIR10 Bits -----------------------------------------------------
INT2IF           EQU  H'0000'
CLC8IF           EQU  H'0001'
TU16BIF          EQU  H'0002'
TMR4IF           EQU  H'0003'
DMA4SCNTIF       EQU  H'0004'
DMA4DCNTIF       EQU  H'0005'
DMA4ORIF         EQU  H'0006'
DMA4AIF          EQU  H'0007'


;----- INTCON0 Bits -----------------------------------------------------
INT0EDG          EQU  H'0000'
INT1EDG          EQU  H'0001'
INT2EDG          EQU  H'0002'
IPEN_INTCON0     EQU  H'0005'
GIEL             EQU  H'0006'
GIE              EQU  H'0007'
GIEH             EQU  H'0007'


;----- INTCON1 Bits -----------------------------------------------------
STAT0_INTCON1    EQU  H'0006'
STAT1_INTCON1    EQU  H'0007'


;----- STATUS Bits -----------------------------------------------------
NOT_PD           EQU  H'0005'
NOT_TO           EQU  H'0006'
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS        EQU  H'0003'
N                EQU  H'0004'
NPD              EQU  H'0005'
NTO              EQU  H'0006'
PD               EQU  H'0005'
TO               EQU  H'0006'


;----- PCON0 Bits -----------------------------------------------------
NOT_BOR          EQU  H'0000'
NOT_POR          EQU  H'0001'
NOT_RI           EQU  H'0002'
NOT_RMCLR        EQU  H'0003'
NOT_RWDT         EQU  H'0004'
NOT_WDTWV        EQU  H'0005'
NBOR             EQU  H'0000'
NPOR             EQU  H'0001'
NRI              EQU  H'0002'
NRMCLR           EQU  H'0003'
NRWDT            EQU  H'0004'
NWDTWV           EQU  H'0005'
STKUNF           EQU  H'0006'
STKOVF           EQU  H'0007'
BOR              EQU  H'0000'
POR              EQU  H'0001'
RI               EQU  H'0002'
RMCLR            EQU  H'0003'
RWDT             EQU  H'0004'
WDTWV            EQU  H'0005'


;----- PCON1 Bits -----------------------------------------------------
NOT_RCM          EQU  H'0000'
NOT_MEMV         EQU  H'0001'
NOT_RVREG        EQU  H'0002'
NRCM             EQU  H'0000'
NMEMV            EQU  H'0001'
NRVREG           EQU  H'0002'
MEMV             EQU  H'0001'


;----- CPUDOZE Bits -----------------------------------------------------
DOE              EQU  H'0004'
ROI              EQU  H'0005'
DOZEN            EQU  H'0006'
IDLEN            EQU  H'0007'
DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'

;==========================================================================
;
;       RAM Definitions
;
;==========================================================================

__MAXRAM  H'08FF'
__BADRAM  H'0000'-H'0038'
__BADRAM  H'003B'-H'003F'
__BADRAM  H'004E'-H'0062'
__BADRAM  H'0069'-H'006E'
__BADRAM  H'008E'-H'00AC'
__BADRAM  H'00BA'-H'00BD'
__BADRAM  H'00C6'-H'00D3'
__BADRAM  H'00E0'-H'00E7'
__BADRAM  H'010E'-H'0110'
__BADRAM  H'0113'-H'011E'
__BADRAM  H'012F'-H'013F'
__BADRAM  H'0143'-H'0147'
__BADRAM  H'014B'
__BADRAM  H'014E'-H'0150'
__BADRAM  H'0153'
__BADRAM  H'0155'-H'01BF'
__BADRAM  H'01EB'-H'0211'
__BADRAM  H'0219'-H'023D'
__BADRAM  H'0246'-H'0247'
__BADRAM  H'024A'-H'024E'
__BADRAM  H'0254'-H'0256'
__BADRAM  H'0259'-H'025A'
__BADRAM  H'025C'-H'0260'
__BADRAM  H'026E'-H'0270'
__BADRAM  H'027B'-H'0284'
__BADRAM  H'02B3'
__BADRAM  H'02B5'
__BADRAM  H'02B7'
__BADRAM  H'02C7'-H'02FF'
__BADRAM  H'0300'-H'0311'
__BADRAM  H'031C'
__BADRAM  H'0329'
__BADRAM  H'0330'-H'033F'
__BADRAM  H'0348'-H'034B'
__BADRAM  H'034E'
__BADRAM  H'0359'
__BADRAM  H'0362'-H'0372'
__BADRAM  H'0384'-H'039F'
__BADRAM  H'03B5'-H'03BB'
__BADRAM  H'03C5'-H'03D6'
__BADRAM  H'0418'-H'041F'
__BADRAM  H'0420'
__BADRAM  H'0422'
__BADRAM  H'0423'
__BADRAM  H'0428'-H'043C'
__BADRAM  H'0448'-H'0457'
__BADRAM  H'048E'-H'0499'
__BADRAM  H'049B'
__BADRAM  H'04BE'-H'04D6'


